---
kind: method
id: M:Autodesk.Revit.UI.RibbonItem.GetContextualHelp
source: html/ab7e7653-789b-6001-123b-5cfde2e2a132.htm
---
# Autodesk.Revit.UI.RibbonItem.GetContextualHelp Method

Gets the contextual help bound with this control.

## Syntax (C#)
```csharp
public ContextualHelp GetContextualHelp()
```

## Returns
The contextual help assigned to the item, or Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no binding assigned.